

#include "libavcodec/avcodec.h"
#include "utils/log.h"
#include "HiDecoder.h"
#include "DVDClock.h"



#if 0
extern void _Z42_107f1b933a62cea021c088004790e758008a3e49Av();
extern bool _Z42_d2050ca4b20719cc67b22956b468894d54294ff8Cv();
#endif


/* complete */
HisiAvDecoder* HisiAvDecoder::GetInstance()
{
  static HisiAvDecoder sHisiAvDecoder;
  return &sHisiAvDecoder;
}


/* complete */
HisiAvDecoder::HisiAvDecoder()
{
  m_opened = false;
  m_video_opend = false;
  m_audio_opend = false;
  m_dump = false;
  m_hAvplay = 0;
  m_hWin = 0;
  m_disp = HI_UNF_DISPLAY1;
  m_audio_full = false;
  m_video_full = false;
}


HisiAvDecoder::~HisiAvDecoder()
{
}


HI_S32 AVEventReport(HI_HANDLE hAvplay, HI_UNF_AVPLAY_EVENT_E enEvent, HI_VOID *pPara)
{
  HisiAvDecoder* pThis = HisiAvDecoder::GetInstance();
  return pThis->EventReport(hAvplay, enEvent, pPara);
}


bool HisiAvDecoder::Init()
{
  CSingleLock lock(m_section);

  HI_UNF_AVPLAY_ATTR_S stAvAttr;
  HI_UNF_SYNC_ATTR_S stSyncAttr;

  if (m_opened)
  {
    return true;
  }

  HI_S32 res = HI_SYS_Init();
  if (res != HI_SUCCESS)
  {
    goto label_1c4;
  }

  res = HI_UNF_OTP_Init();
  if (res != HI_SUCCESS)
  {
    goto label_1c4;
  }

#if 0
  _Z42_107f1b933a62cea021c088004790e758008a3e49Av();
  if (!_Z42_d2050ca4b20719cc67b22956b468894d54294ff8Cv())
  {
    goto label_1c4;
  }
  if (!_Z42_d2050ca4b20719cc67b22956b468894d54294ff8Cv())
  {
    goto label_1c4;
  }
  if (!_Z42_d2050ca4b20719cc67b22956b468894d54294ff8Cv())
  {

    case AV_CODEC_ID_MP3ADU: //0x1500d
    case AV_CODEC_ID_MP3ON4: //0x1500e
      return HA_AUDIO_ID_MP3; //0x21f00003

    case AV_CODEC_ID_COOK: //0x15014
      return HA_AUDIO_ID_COOK; //0x80160009

    case AV_CODEC_ID_PCM_BLURAY: //0x10018
      return HA_AUDIO_ID_BLYRAYLPCM; //0x81210021;

    case AV_CODEC_ID_PCM_S16LE: // = 0x10000
    case AV_CODEC_ID_PCM_S16BE:
    case AV_CODEC_ID_PCM_U16LE:
    case AV_CODEC_ID_PCM_U16BE:
    case AV_CODEC_ID_PCM_S8:
    case AV_CODEC_ID_PCM_U8:
    case AV_CODEC_ID_PCM_MULAW:
    case AV_CODEC_ID_PCM_ALAW:
    case AV_CODEC_ID_PCM_S32LE:
    case AV_CODEC_ID_PCM_S32BE:
    case AV_CODEC_ID_PCM_U32LE:
    case AV_CODEC_ID_PCM_U32BE:
    case AV_CODEC_ID_PCM_S24LE:
    case AV_CODEC_ID_PCM_S24BE:
    case AV_CODEC_ID_PCM_U24LE:
    case AV_CODEC_ID_PCM_U24BE:
    case AV_CODEC_ID_PCM_S24DAUD: //0x10010
    case AV_CODEC_ID_PCM_ZORK:
    case AV_CODEC_ID_PCM_S16LE_PLANAR:
    case AV_CODEC_ID_PCM_DVD:
    case AV_CODEC_ID_PCM_F32BE:
    case AV_CODEC_ID_PCM_F32LE:
    case AV_CODEC_ID_PCM_F64BE: //0x10016
    case AV_CODEC_ID_PCM_F64LE: //0x10017
    case AV_CODEC_ID_PCM_LXF: //0x10019
    case AV_CODEC_ID_S302M:
    case AV_CODEC_ID_PCM_S8_PLANAR:
    case AV_CODEC_ID_PCM_S24LE_PLANAR:
    case AV_CODEC_ID_PCM_S32LE_PLANAR:
    case AV_CODEC_ID_PCM_S16BE_PLANAR: //0x1001E
      //84c
      return HA_AUDIO_ID_PCM; //0x81000000

    default:
      break;
  }

  if ((enc >= AV_CODEC_ID_ADPCM_IMA_QT/*0x11000*/) && (enc <= AV_CODEC_ID_ADPCM_G726LE/*0x11804*/))
    return HA_AUDIO_ID_ADPCM; //0x21300107

  if ((enc >= AV_CODEC_ID_AMR_NB/*0x12000*/) && (enc <= AV_CODEC_ID_SOL_DPCM/*0x14003*/))
    return HA_AUDIO_ID_AMRNB; //0x81600100

  return HA_AUDIO_ID_MP3; //0x21f00003
}


HI_UNF_VCODEC_TYPE_E HisiAvDecoder::codec2vdec(int enc)
{
  switch (enc)
  {
    case AV_CODEC_ID_MPEG1VIDEO: //1:
    case AV_CODEC_ID_MPEG2VIDEO: //2:
    case AV_CODEC_ID_MPEG2VIDEO_XVMC: 
      return HI_UNF_VCODEC_TYPE_MPEG2; //0;
    case AV_CODEC_ID_H261: //3
      return HI_UNF_VCODEC_TYPE_H261; //26;
    case AV_CODEC_ID_H263: //4
      return HI_UNF_VCODEC_TYPE_H263; //3;
    case AV_CODEC_ID_RV10: //5
      return HI_UNF_VCODEC_TYPE_RV10; //22;
    case AV_CODEC_ID_RV20: //6
      return HI_UNF_VCODEC_TYPE_RV20; //23;
    case AV_CODEC_ID_MJPEG: //7
      return HI_UNF_VCODEC_TYPE_MJPEG; //11;
    case AV_CODEC_ID_MJPEGB: //8
      return HI_UNF_VCODEC_TYPE_MJPEGB; //34;
    case AV_CODEC_ID_LJPEG: //9
      return HI_UNF_VCODEC_TYPE_JPEG; //15;
    case AV_CODEC_ID_MPEG4: //12
      return HI_UNF_VCODEC_TYPE_MPEG4; //1;
    case AV_CODEC_ID_RAWVIDEO: //13
      return HI_UNF_VCODEC_TYPE_RAW; //14;
    case AV_CODEC_ID_MSMPEG4V1: //14
      return HI_UNF_VCODEC_TYPE_MSMPEG4V1; //17;
    case AV_CODEC_ID_MSMPEG4V2: //15
      return HI_UNF_VCODEC_TYPE_MSMPEG4V2; //18;
    case AV_CODEC_ID_MSMPEG4V3: //16
      return HI_UNF_VCODEC_TYPE_DIVX3; //13;
    case AV_CODEC_ID_WMV1: //17
      return HI_UNF_VCODEC_TYPE_WMV1; //20;
    case AV_CODEC_ID_WMV2: //18
      return HI_UNF_VCODEC_TYPE_WMV2; //21
    case AV_CODEC_ID_FLV1: //21
      return HI_UNF_VCODEC_TYPE_SORENSON; //12
    case AV_CODEC_ID_SVQ1: //22
      return HI_UNF_VCODEC_TYPE_SVQ1; //24
    case AV_CODEC_ID_SVQ3: //23
      return HI_UNF_VCODEC_TYPE_SVQ3; //25
    case AV_CODEC_ID_DVVIDEO: //24
      return HI_UNF_VCODEC_TYPE_DV; //37
    case AV_CODEC_ID_H264: //27
      return HI_UNF_VCODEC_TYPE_H264; //4
    case AV_CODEC_ID_INDEO3: //28
      return HI_UNF_VCODEC_TYPE_INDEO3; //31
    case AV_CODEC_ID_VP3: //29
      return HI_UNF_VCODEC_TYPE_VP3; //27
    case AV_CODEC_ID_CINEPAK: //43
      return HI_UNF_VCODEC_TYPE_CINEPAK; //29
    case AV_CODEC_ID_MSVIDEO1: //46
      return HI_UNF_VCODEC_TYPE_MSVIDEO1; //19
    case AV_CODEC_ID_RV30: //68
      return HI_UNF_VCODEC_TYPE_REAL8; //5
    case AV_CODEC_ID_RV40: //69
      return HI_UNF_VCODEC_TYPE_REAL9; //6
    case AV_CODEC_ID_VC1: //70
      return HI_UNF_VCODEC_TYPE_VC1; //7
    case AV_CODEC_ID_INDEO2: //75
      return HI_UNF_VCODEC_TYPE_INDEO2; //30
    case AV_CODEC_ID_AVS: //82
      return HI_UNF_VCODEC_TYPE_AVS; //2
    case AV_CODEC_ID_KMVC: //85?
      return HI_UNF_VCODEC_TYPE_MVC; //35;
    case AV_CODEC_ID_CAVS: //87?
      return HI_UNF_VCODEC_TYPE_AVS2; //39;
    case AV_CODEC_ID_JPEG2000: //88?
      return HI_UNF_VCODEC_TYPE_JPEG; //15;
    case AV_CODEC_ID_VP5: //90
      return HI_UNF_VCODEC_TYPE_VP5; //28
    case AV_CODEC_ID_VP6: //91
      return HI_UNF_VCODEC_TYPE_VP6; //8
    case AV_CODEC_ID_VP6F: //92
      return HI_UNF_VCODEC_TYPE_VP6F; //9
    case AV_CODEC_ID_VP6A: //106
      return HI_UNF_VCODEC_TYPE_VP6A; //10
    case AV_CODEC_ID_INDEO4: //111
      return HI_UNF_VCODEC_TYPE_INDEO4; //32
    case AV_CODEC_ID_INDEO5: //112
      return HI_UNF_VCODEC_TYPE_INDEO5; //33
    case AV_CODEC_ID_VP8: //139
      return HI_UNF_VCODEC_TYPE_VP8; //16
    case AV_CODEC_ID_VP9: //167
      return HI_UNF_VCODEC_TYPE_VP9; //38
    case AV_CODEC_ID_HEVC: //173
      return HI_UNF_VCODEC_TYPE_HEVC; //36
    default:
      return HI_UNF_VCODEC_TYPE_BUTT; //40;
  }
}


HI_S32 HisiAvDecoder::EventReport(HI_HANDLE hAvplay, HI_UNF_AVPLAY_EVENT_E enEvent, HI_VOID* pPara)
{
  CSingleLock lock(m_EventMutex);

  switch (enEvent)
  {
    case HI_UNF_AVPLAY_EVENT_EOS: 
      m_eos = true;
      break;

    case HI_UNF_AVPLAY_EVENT_NEW_VID_FRAME:
    {
      typedef struct
      { 
        int fill[16];
        HI_U32 u32PtsMs;
      } HI_UNF_VO_FRAMEINFO_S;

      HI_UNF_VO_FRAMEINFO_S* pFrameInfo = (HI_UNF_VO_FRAMEINFO_S*)pPara;

      if (m_vptsQueue.begin() == m_vptsQueue.end()) //!m_vptsQueue.size())
      {
        m_video_1st_pts = pFrameInfo->u32PtsMs * 1000.0f;
      }

      m_vptsQueue.push_back(pFrameInfo->u32PtsMs);
      break;
    }

    case HI_UNF_AVPLAY_EVENT_NEW_AUD_FRAME:
    {
      HI_UNF_AO_FRAMEINFO_S* pFrameInfo = (HI_UNF_AO_FRAMEINFO_S*)pPara;

      if (m_aptsQueue.begin() == m_aptsQueue.end()) //!m_aptsQueue.size())
      {
